FluidConfiguration/Case/0/alpha.water.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7  
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    inlet
    {
        type            inletOutlet;
        value           uniform 0;
        inletValue      uniform 0;
    }

    outlet
    {
        type            zeroGradient;
    }

    walls
    {
        type           constantAlphaContactAngle;
        theta0         10;
        limit          gradient;
        value          uniform 1;
    }

    sym
    {
        type            symmetryPlane;
    }

    frontAndBack1
    {
        type            empty;
    }

    frontAndBack2
    {
        type            empty;
    }

}


// ************************************************************************* //
